# vsoWidgetPopupGetID

## Description
For an OIP search popup widget, returns the IDName for an item specified by it's text.

```pascal
FUNCTION vsoWidgetPopupGetID(
				widgetID : LONGINT;
				text     : STRING) : STRING;
```

```python

def vs.vsoWidgetPopupGetID(widgetID, text):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|text|STRING||

## Version
Availability: from Vectorworks 2020
## Category
* Object Events